3A/SE350/Memory-Management.org
#+title: Memory Management
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode

* Memory Management Requirements
*Frame*: a fixed-length block of main memory

*Page*: a fixed-length block of data that resides in secondary memory, may be temporarily
copied into a frame of main memory

*Segment*: a variable-length block of data that resides in secondary memory, may be
temporarily copied into an available region of main memory (segmentation) or the segment
may be divided into pages which can individually be copied into main memory (combined
segmentation and paging)

Memory management is intended to satisfy relocation, protection, sharing, logical
organization, and physical organization.

** Relocation
For multiprogramming systems, main memory is shared among processes that must be
swapped in and out of main memory to maximize processor utilization.
During swapping, the process may be required to relocate to a different area of memory.

Since a program's location is not known ahead of time, there are some concerns related
to addressing:
- OS needs to know location of process control info, execution stack, and entry point
  to the program for this process
- processor must deal with memory references within the program such as branch
  instructions and data reference instructions

** Protection
Each process should be protected against interference from other processes: no
referencing memory locations in other processes, for instructions or data,
without permission.

All memory referencs generated by a process must be checked at runtime to ensure
they only refer to the memory space allocated to that process.

Memory protection must be satisfied by the processor rather than OS since it is
only possible to assess the permissibility of a memory reference at the time of
execution of the instruction making the reference.

** Sharing
Protection must still allow processes cooperating on some task to share access to the
same data structure.

The memory management system must allow controlled access to shared areas of memory
without compromising essential protection.

** Logical Organization
Most programs are organized into modules (some modifiable, some unmodifiable), and so
if the OS and computer hardware can effectively deal with programs and data in the
form of modules, then some advantages can be realized:
1. Modules can be written and compiled independently, with all references from one
   module to another resolved by the system at runtime.
2. With some additional overhead, different degrees of protection (read only, execute
   only, etc) can be given to different modules.
3. Possible to introduce mechanisms by which modules can be shared among processes,
   and so the advantage of providing sharing on a module level is that this corresponds
   to the user's way of viewing the problem, hence easy for the user to specify the
   sharing desired.

Mainly satisfied by segmentation.

** Physical Organization
Moving information between two levels of memory should be a system responsibility
because:
1. The main memory available for a program and its data may be insufficient, so the
   programmer will need to engage in overlaying, where the program and data are
   organized such that various modules can be assigned the same region of memory
   with a main program switching modules in and out as needed, though this wastes
   programmer time.
2. For multiprogramming, the programmer does not know at the time of coding how much
   space wll be available or where that space will be.

* Memory Partitioning
Memory management in modern multiprogramming systems involves virtual memory, which
is based on the use of segmentation and paging.

Memory management schemes assume the OS occupies some fixed portion of main memory
and the remaining memory can be used by multiple processes.

