3A/SE350/Memory-Management.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-22 Thu 15:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Memory Management</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Memory Management</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf3d73b7">1. Memory Management Requirements</a>
<ul>
<li><a href="#orgdd4e959">1.1. Relocation</a></li>
<li><a href="#org46d497d">1.2. Protection</a></li>
<li><a href="#org1954489">1.3. Sharing</a></li>
<li><a href="#orgf3c891c">1.4. Logical Organization</a></li>
<li><a href="#orgbcea78a">1.5. Physical Organization</a></li>
</ul>
</li>
<li><a href="#org8720cd7">2. Memory Partitioning</a>
<ul>
<li><a href="#org97ab9ff">2.1. Fixed Partitioning</a>
<ul>
<li><a href="#org87e1a38">2.1.1. Partition Sizes</a></li>
<li><a href="#org70d80d1">2.1.2. Placement Algorithm</a></li>
</ul>
</li>
<li><a href="#org968aa8b">2.2. Dynamic Partitioning</a>
<ul>
<li><a href="#orge242668">2.2.1. Placement Algorithm</a></li>
<li><a href="#org6efc96d">2.2.2. Replacement Algorithm</a></li>
</ul>
</li>
<li><a href="#org522e72d">2.3. Buddy System</a></li>
<li><a href="#org83039d1">2.4. Relocation</a></li>
</ul>
</li>
<li><a href="#org9170fb6">3. Paging</a></li>
<li><a href="#orgad88835">4. Segmentation</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3d73b7" class="outline-2">
<h2 id="orgf3d73b7"><span class="section-number-2">1.</span> Memory Management Requirements</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Frame</b>: a fixed-length block of main memory
</p>

<p>
<b>Page</b>: a fixed-length block of data that resides in secondary memory, may be temporarily
copied into a frame of main memory
</p>

<p>
<b>Segment</b>: a variable-length block of data that resides in secondary memory, may be
temporarily copied into an available region of main memory (segmentation) or the segment
may be divided into pages which can individually be copied into main memory (combined
segmentation and paging)
</p>

<p>
Memory management is intended to satisfy relocation, protection, sharing, logical
organization, and physical organization.
</p>
</div>
<div id="outline-container-orgdd4e959" class="outline-3">
<h3 id="orgdd4e959"><span class="section-number-3">1.1.</span> Relocation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For multiprogramming systems, main memory is shared among processes that must be
swapped in and out of main memory to maximize processor utilization.
During swapping, the process may be required to relocate to a different area of memory.
</p>

<p>
Since a program&rsquo;s location is not known ahead of time, there are some concerns related
to addressing:
</p>
<ul class="org-ul">
<li>OS needs to know location of process control info, execution stack, and entry point
to the program for this process</li>
<li>processor must deal with memory references within the program such as branch
instructions and data reference instructions</li>
</ul>
</div>
</div>
<div id="outline-container-org46d497d" class="outline-3">
<h3 id="org46d497d"><span class="section-number-3">1.2.</span> Protection</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Each process should be protected against interference from other processes: no
referencing memory locations in other processes, for instructions or data,
without permission.
</p>

<p>
All memory referencs generated by a process must be checked at runtime to ensure
they only refer to the memory space allocated to that process.
</p>

<p>
Memory protection must be satisfied by the processor rather than OS since it is
only possible to assess the permissibility of a memory reference at the time of
execution of the instruction making the reference.
</p>
</div>
</div>
<div id="outline-container-org1954489" class="outline-3">
<h3 id="org1954489"><span class="section-number-3">1.3.</span> Sharing</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Protection must still allow processes cooperating on some task to share access to the
same data structure.
</p>

<p>
The memory management system must allow controlled access to shared areas of memory
without compromising essential protection.
</p>
</div>
</div>
<div id="outline-container-orgf3c891c" class="outline-3">
<h3 id="orgf3c891c"><span class="section-number-3">1.4.</span> Logical Organization</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Most programs are organized into modules (some modifiable, some unmodifiable), and so
if the OS and computer hardware can effectively deal with programs and data in the
form of modules, then some advantages can be realized:
</p>
<ol class="org-ol">
<li>Modules can be written and compiled independently, with all references from one
module to another resolved by the system at runtime.</li>
<li>With some additional overhead, different degrees of protection (read only, execute
only, etc) can be given to different modules.</li>
<li>Possible to introduce mechanisms by which modules can be shared among processes,
and so the advantage of providing sharing on a module level is that this corresponds
to the user&rsquo;s way of viewing the problem, hence easy for the user to specify the
sharing desired.</li>
</ol>

<p>
Mainly satisfied by segmentation.
</p>
</div>
</div>
<div id="outline-container-orgbcea78a" class="outline-3">
<h3 id="orgbcea78a"><span class="section-number-3">1.5.</span> Physical Organization</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Moving information between two levels of memory should be a system responsibility
because:
</p>
<ol class="org-ol">
<li>The main memory available for a program and its data may be insufficient, so the
programmer will need to engage in overlaying, where the program and data are
organized such that various modules can be assigned the same region of memory
with a main program switching modules in and out as needed, though this wastes
programmer time.</li>
<li>For multiprogramming, the programmer does not know at the time of coding how much
space wll be available or where that space will be.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org8720cd7" class="outline-2">
<h2 id="org8720cd7"><span class="section-number-2">2.</span> Memory Partitioning</h2>
<div class="outline-text-2" id="text-2">
<p>
Memory management in modern multiprogramming systems involves virtual memory, which
is based on the use of segmentation and paging.
</p>

<p>
Memory management schemes assume the OS occupies some fixed portion of main memory
and the remaining memory can be used by multiple processes.
</p>
</div>
