3A/SE350/Memory-Management.tex
% Created 2024-03-26 Tue 20:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Memory Management}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Memory Management},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Memory Management Requirements}
\label{sec:orgabb0100}
\textbf{Frame}: a fixed-length block of main memory

\textbf{Page}: a fixed-length block of data that resides in secondary memory, may be temporarily
copied into a frame of main memory

\textbf{Segment}: a variable-length block of data that resides in secondary memory, may be
temporarily copied into an available region of main memory (segmentation) or the segment
may be divided into pages which can individually be copied into main memory (combined
segmentation and paging)

Memory management is intended to satisfy relocation, protection, sharing, logical
organization, and physical organization.
\subsection{Relocation}
\label{sec:org2388b23}
For multiprogramming systems, main memory is shared among processes that must be
swapped in and out of main memory to maximize processor utilization.
During swapping, the process may be required to relocate to a different area of memory.

Since a program's location is not known ahead of time, there are some concerns related
to addressing:
\begin{itemize}
\item OS needs to know location of process control info, execution stack, and entry point
to the program for this process
\item processor must deal with memory references within the program such as branch
instructions and data reference instructions
\end{itemize}
\subsection{Protection}
\label{sec:org0728a61}
Each process should be protected against interference from other processes: no
referencing memory locations in other processes, for instructions or data,
without permission.

All memory referencs generated by a process must be checked at runtime to ensure
they only refer to the memory space allocated to that process.

Memory protection must be satisfied by the processor rather than OS since it is
only possible to assess the permissibility of a memory reference at the time of
execution of the instruction making the reference.
\subsection{Sharing}
\label{sec:org9877cf6}
Protection must still allow processes cooperating on some task to share access to the
same data structure.

The memory management system must allow controlled access to shared areas of memory
without compromising essential protection.
\subsection{Logical Organization}
\label{sec:org0d402cc}
Most programs are organized into modules (some modifiable, some unmodifiable), and so
if the OS and computer hardware can effectively deal with programs and data in the
form of modules, then some advantages can be realized:
\begin{enumerate}
\item Modules can be written and compiled independently, with all references from one
module to another resolved by the system at runtime.
\item With some additional overhead, different degrees of protection (read only, execute
only, etc) can be given to different modules.
\item Possible to introduce mechanisms by which modules can be shared among processes,
and so the advantage of providing sharing on a module level is that this corresponds
to the user's way of viewing the problem, hence easy for the user to specify the
sharing desired.
\end{enumerate}

Mainly satisfied by segmentation.
\subsection{Physical Organization}
\label{sec:org888ccc9}
Moving information between two levels of memory should be a system responsibility
because:
\begin{enumerate}
\item The main memory available for a program and its data may be insufficient, so the
programmer will need to engage in overlaying, where the program and data are
organized such that various modules can be assigned the same region of memory
with a main program switching modules in and out as needed, though this wastes
programmer time.
\item For multiprogramming, the programmer does not know at the time of coding how much
space wll be available or where that space will be.
\end{enumerate}
\section{Memory Partitioning}
\label{sec:org7527168}
Memory management in modern multiprogramming systems involves virtual memory, which
is based on the use of segmentation and paging.

Memory management schemes assume the OS occupies some fixed portion of main memory
and the remaining memory can be used by multiple processes.
