3A/SE350/Memory-Management.org
** Fixed Partitioning
Scheme is to partition available memory into regions with fixed boundaries.

Main advantage is they are simple to implement with little OS overhead.

Disadvantages:
- number of partitions specified at system generation time limits the number of
  active processes in the system
- since partition sizes are preset at system generation time, small jobs will not
  use partition space efficiently, which is in most cases inefficient (unless
  storage requirement of all jobs is known beforehand)

*** Partition Sizes
This could be done with equal-size partitions, but this has the following
difficulties:
- a program may be too big to fit into a partition, which would require the
  programmer to use overlays so only a portion of the program needs to be in main
  memory at any time
- main memory utilization is inefficient as a program of any size will occupy an
  entire partition, leading to *internal fragmentation*

These problems can be lessened by unequal-size partitions, so that larger programs
can be accommodated without overlays and smaller programs can be accommodated with
less internal fragmentation.

*** Placement Algorithm
With equal-size partitions, a process can be loaded into any arbitrary available
partition. If none exists, choosing which to swap out is a scheduling decision.

With unequal-size partitions, there are 2 possible strategies:
- assign each process to the smallest partition within which it will fit, so
  a scheduling queue is needed to hold swapped out processes destined for that
  partition
  - advantage: processes are always assigned to minimize wasted memory within a
    partition (less internal fragmentation)
  - disadvantage: larger partitions could always remain unused
- employ a single queue for all processes, and when loading a process into main
  memory, the smallest available partition that can hold the process is
  selected, or if all partitions are ocurpied swapping occurs based on the
  smallest partition that will hold the process, priority, or blocked proceses

** Dynamic Partitioning
Partitions are of variable length and number, so when a process is brought into
main memory it is allocated exactly as much memory as it requires.

This starts well but leads to memory becoming fragmented and memory utilization
declining, with the holes between processes causing *external fragmentation*.

To overcome external fragmentation, use *compaction*: where the OS shifts
processes so they are contiguous and all free memory is together in one block.
However, this is time consuming, wasting processor time, and requires dynamic
relocation capability.

Disadvantages are complexity to maintain and overhead of compaction.

*** Placement Algorithm
To avoid compaction, the OS designer must use an efficient algorithm to assign
processes to memory.

Possible algorithms that choose among free blocks of main memory of appropriate
size are:
- *best-fit*: chooses the block closes in size to the request
  - usually the worst performer as it leaves the smallest fragment behind
  - result is that main memory is littered with blocks too small to satisfy
    memory allocation requests so more compaction
- *first-fit*: scans memory from the beginning and chooses the first available
  block large enough
  - simplest and often best and fastest
  - may litter the front end with small free partitions that must be searched
    over on each first-fit pass
- *next-fit*: scans memory from the location of the last placement and chooses
  the next available block large enough
  - slightly worse than first-fit, as it more frequently leads to an allocation
    from a free block at the end of memory, so the largest block is quickly
    broken into small fragments leading to more compaction

*** Replacement Algorithm
When all processes in main memory are blocked, the OS swaps one process out
for a process in a Ready-Suspend state.

