3A/SE350/Memory-Management.html
<div id="outline-container-org97ab9ff" class="outline-3">
<h3 id="org97ab9ff"><span class="section-number-3">2.1.</span> Fixed Partitioning</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Scheme is to partition available memory into regions with fixed boundaries.
</p>

<p>
Main advantage is they are simple to implement with little OS overhead.
</p>

<p>
Disadvantages:
</p>
<ul class="org-ul">
<li>number of partitions specified at system generation time limits the number of
active processes in the system</li>
<li>since partition sizes are preset at system generation time, small jobs will not
use partition space efficiently, which is in most cases inefficient (unless
storage requirement of all jobs is known beforehand)</li>
</ul>
</div>
<div id="outline-container-org87e1a38" class="outline-4">
<h4 id="org87e1a38"><span class="section-number-4">2.1.1.</span> Partition Sizes</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
This could be done with equal-size partitions, but this has the following
difficulties:
</p>
<ul class="org-ul">
<li>a program may be too big to fit into a partition, which would require the
programmer to use overlays so only a portion of the program needs to be in main
memory at any time</li>
<li>main memory utilization is inefficient as a program of any size will occupy an
entire partition, leading to <b>internal fragmentation</b></li>
</ul>

<p>
These problems can be lessened by unequal-size partitions, so that larger programs
can be accommodated without overlays and smaller programs can be accommodated with
less internal fragmentation.
</p>
</div>
</div>
<div id="outline-container-org70d80d1" class="outline-4">
<h4 id="org70d80d1"><span class="section-number-4">2.1.2.</span> Placement Algorithm</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
With equal-size partitions, a process can be loaded into any arbitrary available
partition. If none exists, choosing which to swap out is a scheduling decision.
</p>

<p>
With unequal-size partitions, there are 2 possible strategies:
</p>
<ul class="org-ul">
<li>assign each process to the smallest partition within which it will fit, so
a scheduling queue is needed to hold swapped out processes destined for that
partition
<ul class="org-ul">
<li>advantage: processes are always assigned to minimize wasted memory within a
partition (less internal fragmentation)</li>
<li>disadvantage: larger partitions could always remain unused</li>
</ul></li>
<li>employ a single queue for all processes, and when loading a process into main
memory, the smallest available partition that can hold the process is
selected, or if all partitions are ocurpied swapping occurs based on the
smallest partition that will hold the process, priority, or blocked proceses</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org968aa8b" class="outline-3">
<h3 id="org968aa8b"><span class="section-number-3">2.2.</span> Dynamic Partitioning</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Partitions are of variable length and number, so when a process is brought into
main memory it is allocated exactly as much memory as it requires.
</p>

<p>
This starts well but leads to memory becoming fragmented and memory utilization
declining, with the holes between processes causing <b>external fragmentation</b>.
</p>

<p>
To overcome external fragmentation, use <b>compaction</b>: where the OS shifts
processes so they are contiguous and all free memory is together in one block.
However, this is time consuming, wasting processor time, and requires dynamic
relocation capability.
</p>

<p>
Disadvantages are complexity to maintain and overhead of compaction.
</p>
</div>
<div id="outline-container-orge242668" class="outline-4">
<h4 id="orge242668"><span class="section-number-4">2.2.1.</span> Placement Algorithm</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
To avoid compaction, the OS designer must use an efficient algorithm to assign
processes to memory.
</p>

<p>
Possible algorithms that choose among free blocks of main memory of appropriate
size are:
</p>
<ul class="org-ul">
<li><b>best-fit</b>: chooses the block closes in size to the request
<ul class="org-ul">
<li>usually the worst performer as it leaves the smallest fragment behind</li>
<li>result is that main memory is littered with blocks too small to satisfy
memory allocation requests so more compaction</li>
</ul></li>
<li><b>first-fit</b>: scans memory from the beginning and chooses the first available
block large enough
<ul class="org-ul">
<li>simplest and often best and fastest</li>
<li>may litter the front end with small free partitions that must be searched
over on each first-fit pass</li>
</ul></li>
<li><b>next-fit</b>: scans memory from the location of the last placement and chooses
the next available block large enough
<ul class="org-ul">
<li>slightly worse than first-fit, as it more frequently leads to an allocation
from a free block at the end of memory, so the largest block is quickly
broken into small fragments leading to more compaction</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6efc96d" class="outline-4">
<h4 id="org6efc96d"><span class="section-number-4">2.2.2.</span> Replacement Algorithm</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
When all processes in main memory are blocked, the OS swaps one process out
for a process in a Ready-Suspend state.
</p>
</div>
</div>
</div>
