3A/SE350/Memory-Management.tex
\subsection{Fixed Partitioning}
\label{sec:orgaf34e7b}
Scheme is to partition available memory into regions with fixed boundaries.

Main advantage is they are simple to implement with little OS overhead.

Disadvantages:
\begin{itemize}
\item number of partitions specified at system generation time limits the number of
active processes in the system
\item since partition sizes are preset at system generation time, small jobs will not
use partition space efficiently, which is in most cases inefficient (unless
storage requirement of all jobs is known beforehand)
\end{itemize}
\subsubsection{Partition Sizes}
\label{sec:orgff5fdd6}
This could be done with equal-size partitions, but this has the following
difficulties:
\begin{itemize}
\item a program may be too big to fit into a partition, which would require the
programmer to use overlays so only a portion of the program needs to be in main
memory at any time
\item main memory utilization is inefficient as a program of any size will occupy an
entire partition, leading to \textbf{internal fragmentation}
\end{itemize}

These problems can be lessened by unequal-size partitions, so that larger programs
can be accommodated without overlays and smaller programs can be accommodated with
less internal fragmentation.
\subsubsection{Placement Algorithm}
\label{sec:org8430455}
With equal-size partitions, a process can be loaded into any arbitrary available
partition. If none exists, choosing which to swap out is a scheduling decision.

With unequal-size partitions, there are 2 possible strategies:
\begin{itemize}
\item assign each process to the smallest partition within which it will fit, so
a scheduling queue is needed to hold swapped out processes destined for that
partition
\begin{itemize}
\item advantage: processes are always assigned to minimize wasted memory within a
partition (less internal fragmentation)
\item disadvantage: larger partitions could always remain unused
\end{itemize}
\item employ a single queue for all processes, and when loading a process into main
memory, the smallest available partition that can hold the process is
selected, or if all partitions are ocurpied swapping occurs based on the
smallest partition that will hold the process, priority, or blocked proceses
\end{itemize}
\subsection{Dynamic Partitioning}
\label{sec:org334c43d}
Partitions are of variable length and number, so when a process is brought into
main memory it is allocated exactly as much memory as it requires.

This starts well but leads to memory becoming fragmented and memory utilization
declining, with the holes between processes causing \textbf{external fragmentation}.

To overcome external fragmentation, use \textbf{compaction}: where the OS shifts
processes so they are contiguous and all free memory is together in one block.
However, this is time consuming, wasting processor time, and requires dynamic
relocation capability.

Disadvantages are complexity to maintain and overhead of compaction.
\subsubsection{Placement Algorithm}
\label{sec:org9af2908}
To avoid compaction, the OS designer must use an efficient algorithm to assign
processes to memory.

Possible algorithms that choose among free blocks of main memory of appropriate
size are:
\begin{itemize}
\item \textbf{best-fit}: chooses the block closes in size to the request
\begin{itemize}
\item usually the worst performer as it leaves the smallest fragment behind
\item result is that main memory is littered with blocks too small to satisfy
memory allocation requests so more compaction
\end{itemize}
\item \textbf{first-fit}: scans memory from the beginning and chooses the first available
block large enough
\begin{itemize}
\item simplest and often best and fastest
\item may litter the front end with small free partitions that must be searched
over on each first-fit pass
\end{itemize}
\item \textbf{next-fit}: scans memory from the location of the last placement and chooses
the next available block large enough
\begin{itemize}
\item slightly worse than first-fit, as it more frequently leads to an allocation
from a free block at the end of memory, so the largest block is quickly
broken into small fragments leading to more compaction
\end{itemize}
\end{itemize}
\subsubsection{Replacement Algorithm}
\label{sec:org6c6637b}
When all processes in main memory are blocked, the OS swaps one process out
for a process in a Ready-Suspend state.
