3A/SE350/Memory-Management.org
** Buddy System
Memory blocks are available as size $2^{K}$ works for $L \le K \le U$ where
$2^{L}$ is the smallest size block allocated and $2^{U}$ is the largest size
block allocated (size of the entire memory available).

Process works as follows:
1. Begin with the entire space available for allocation, treated as a single
   block of size $2^{U}$.
2. If a request of size $s$ such that $2^{U-1} < s \le 2^{U}$ is made, the entire
   block is allocated.
   a. Otherwise, the block is split into 2 equal buddies of size $2^{U-1}$,
      with this process repeating until the smallest block $\ge s$ is generated
      and allocated to the request.

At any time, the buddy system maintains a list of holes of size $2^{i}$.
Whenever a pair of buddies on the $i$ list is unallocated, they are removed from
that list and coalesced into a single block on the $(i+1)$ list.

The following algorithm is used to find a hole of size $2^{i}$:
#+BEGIN_SRC c
void get_hole(int i)
{
    if (i == (U + 1)) <failure>;
    if (<i_list empty>) {
        get_hole(i + 1);
        <split hole into buddies>;
        <put buddies on i_list>;
    }
    <take first hole on i_list>;
}
#+END_SRC

In a binary tree representation of the buddy allocation system, the leaf nodes
represent the current partitioning of the memory, and if two buddies are leaf nodes,
at least one must be allocated, otherwise they are coalesced into a larger block.

Works as a reasonable compromise to overcome the disadvantages of fixed and dynamic
partitioning (especially for parallel systems), but not as good as paging and
segmentation.

** Relocation
For some fixed partitioning, whichever partition is selected when a new process is loaded
will always be used to swap that process back into memory after it has been swapped out,
so when the process is first loaded, all relative memory references in the code are
replaced by absolute main memory addresses, determined by the base address of the loaded
process.

For equal-size partitioning, unequal-size partitioning (with a single queue), and dynamic
partitioning, a process may be assigned to a different partition after being swapped out.
Further, processes are shifted during compaction.

Locations referenced by a process are not fixed, so distinctions are made:
- *logical address*: a reference to a memory location independent of the current
  assignment of data to memory, translation must be made to a physical address before
  a memory access occurs
- *relative address*: address is expressed as a location relative to some known point,
  usually a value in a processor register
  - typically relative to the origin of the program
  - hardware mechanism needed to translate relative addresses to physical main memory
    addresses at the time of execution
- *physical address*: actual location in main memory

For relative addresses:
1. When a process is assigned to the Running state, a special processor register (base)
   is loaded with the starting address in main memory of the program.
   a. A bounds register also indicates the end of the program.
2. When relative addresses are encountered, they go through 2 steps of manipulation by
   the processor:
   a. the value in the base register is added to produce an absolute address
   b. the resulting address is compared to the bounds register, and if it is within
      bounds the instruction proceeds, else an interrupt is generated to the OS

