3A/SE350/Memory-Management.html
<div id="outline-container-org522e72d" class="outline-3">
<h3 id="org522e72d"><span class="section-number-3">2.3.</span> Buddy System</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Memory blocks are available as size \(2^{K}\) works for \(L \le K \le U\) where
\(2^{L}\) is the smallest size block allocated and \(2^{U}\) is the largest size
block allocated (size of the entire memory available).
</p>

<p>
Process works as follows:
</p>
<ol class="org-ol">
<li>Begin with the entire space available for allocation, treated as a single
block of size \(2^{U}\).</li>
<li>If a request of size \(s\) such that \(2^{U-1} < s \le 2^{U}\) is made, the entire
block is allocated.
<ol class="org-ol">
<li>Otherwise, the block is split into 2 equal buddies of size \(2^{U-1}\),
with this process repeating until the smallest block \(\ge s\) is generated
and allocated to the request.</li>
</ol></li>
</ol>

<p>
At any time, the buddy system maintains a list of holes of size \(2^{i}\).
Whenever a pair of buddies on the \(i\) list is unallocated, they are removed from
that list and coalesced into a single block on the \((i+1)\) list.
</p>

<p>
The following algorithm is used to find a hole of size \(2^{i}\):
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">get_hole</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>i == <span style="color: #98be65;">(</span>U + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> &lt;failure&gt;;
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>&lt;i_list empty&gt;<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        get_hole<span style="color: #98be65;">(</span>i + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #98be65;">)</span>;
        &lt;split hole into buddies&gt;;
        &lt;put buddies on i_list&gt;;
    <span style="color: #c678dd;">}</span>
    &lt;take first hole on i_list&gt;;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
In a binary tree representation of the buddy allocation system, the leaf nodes
represent the current partitioning of the memory, and if two buddies are leaf nodes,
at least one must be allocated, otherwise they are coalesced into a larger block.
</p>

<p>
Works as a reasonable compromise to overcome the disadvantages of fixed and dynamic
partitioning (especially for parallel systems), but not as good as paging and
segmentation.
</p>
</div>
</div>
<div id="outline-container-org83039d1" class="outline-3">
<h3 id="org83039d1"><span class="section-number-3">2.4.</span> Relocation</h3>
<div class="outline-text-3" id="text-2-4">
<p>
For some fixed partitioning, whichever partition is selected when a new process is loaded
will always be used to swap that process back into memory after it has been swapped out,
so when the process is first loaded, all relative memory references in the code are
replaced by absolute main memory addresses, determined by the base address of the loaded
process.
</p>

<p>
For equal-size partitioning, unequal-size partitioning (with a single queue), and dynamic
partitioning, a process may be assigned to a different partition after being swapped out.
Further, processes are shifted during compaction.
</p>

<p>
Locations referenced by a process are not fixed, so distinctions are made:
</p>
<ul class="org-ul">
<li><b>logical address</b>: a reference to a memory location independent of the current
assignment of data to memory, translation must be made to a physical address before
a memory access occurs</li>
<li><b>relative address</b>: address is expressed as a location relative to some known point,
usually a value in a processor register
<ul class="org-ul">
<li>typically relative to the origin of the program</li>
<li>hardware mechanism needed to translate relative addresses to physical main memory
addresses at the time of execution</li>
</ul></li>
<li><b>physical address</b>: actual location in main memory</li>
</ul>

<p>
For relative addresses:
</p>
<ol class="org-ol">
<li>When a process is assigned to the Running state, a special processor register (base)
is loaded with the starting address in main memory of the program.
<ol class="org-ol">
<li>A bounds register also indicates the end of the program.</li>
</ol></li>
<li>When relative addresses are encountered, they go through 2 steps of manipulation by
the processor:
<ol class="org-ol">
<li>the value in the base register is added to produce an absolute address</li>
<li>the resulting address is compared to the bounds register, and if it is within
bounds the instruction proceeds, else an interrupt is generated to the OS</li>
</ol></li>
</ol>
</div>
</div>
</div>
