3A/SE350/Memory-Management.html
<div id="outline-container-org9170fb6" class="outline-2">
<h2 id="org9170fb6"><span class="section-number-2">3.</span> Paging</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Pages</b>: chunks of a process
</p>

<p>
<b>Frames</b>: available chunks of memory.
</p>

<p>
At any given point in time, some frames in memory are in use and some are free, with a
list of free frames being maintained by the OS.
</p>

<p>
If there is enough contiguous unused space frames to hold a process, they are used.
Otherwise, the OS maintains a <b>page table</b> for each process that shows the frame location
for each page of the process.
</p>

<p>
The OS also maintains a free-frame list of all the frames in main memory that are
currently unoccupied and available for pages.
</p>

<p>
Within the program, logical addresses consist of a page number and an offset within the
page, and this translation is done by the hardware.
</p>

<p>
Relative and logical addresses are the same when the page size is a power of 2.
Further this makes dynamic address translation at runtime easier for the hardware, as
only the following steps are needed for address translation:
</p>
<ol class="org-ol">
<li>extract the page number from the logical address (leftmost \(n\) bits)</li>
<li>use the page number as an index into the process page table to find the frame number
\(k\)</li>
<li>the starting physical address of the frame is \(k \times 2^{m}\) and the physical
address of the referenced byte is that number plus the offset (which is just appending
that number to the offset)</li>
</ol>
</div>
</div>
<div id="outline-container-orgad88835" class="outline-2">
<h2 id="orgad88835"><span class="section-number-2">4.</span> Segmentation</h2>
<div class="outline-text-2" id="text-4">
<p>
A user program can be divided into variable-length segments (with a max length), and
similar to paging logical addresses consist of a segment number and an offset.
</p>

<p>
Similar to dynamic partitioning, but with segmentation a program may occupy more than one
partition and these partitions do not need to be contiguous.
</p>

<p>
Can still cause external fragmentation, though less than dynamic partitioning since a
program can be broken into pieces.
</p>

<p>
Unlike paging, segmentation is visible to the programer, so modular programs can be
broken down into multiple segments (within the size limitation).
</p>

<p>
No simple relation between logical and physical addresses (since unequal size segments).
Each segment table entry must have the starting address of the segment in main memory
and the length of the segment.
</p>

<p>
Procedure is similar to paging, except requires checking against size of segment and
requires addition rather than appending numbers.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-22 Thu 15:33</p>
</div>
</body>
</html>
