3A/SE350/Memory-Management.tex
\section{Paging}
\label{sec:org0f1d209}
\textbf{Pages}: chunks of a process

\textbf{Frames}: available chunks of memory.

At any given point in time, some frames in memory are in use and some are free, with a
list of free frames being maintained by the OS.

If there is enough contiguous unused space frames to hold a process, they are used.
Otherwise, the OS maintains a \textbf{page table} for each process that shows the frame location
for each page of the process.

The OS also maintains a free-frame list of all the frames in main memory that are
currently unoccupied and available for pages.

Within the program, logical addresses consist of a page number and an offset within the
page, and this translation is done by the hardware.

Relative and logical addresses are the same when the page size is a power of 2.
Further this makes dynamic address translation at runtime easier for the hardware, as
only the following steps are needed for address translation:
\begin{enumerate}
\item extract the page number from the logical address (leftmost \(n\) bits)
\item use the page number as an index into the process page table to find the frame number
\(k\)
\item the starting physical address of the frame is \(k \times 2^{m}\) and the physical
address of the referenced byte is that number plus the offset (which is just appending
that number to the offset)
\end{enumerate}
\section{Segmentation}
\label{sec:org22c2b76}
A user program can be divided into variable-length segments (with a max length), and
similar to paging logical addresses consist of a segment number and an offset.

Similar to dynamic partitioning, but with segmentation a program may occupy more than one
partition and these partitions do not need to be contiguous.

Can still cause external fragmentation, though less than dynamic partitioning since a
program can be broken into pieces.

Unlike paging, segmentation is visible to the programer, so modular programs can be
broken down into multiple segments (within the size limitation).

No simple relation between logical and physical addresses (since unequal size segments).
Each segment table entry must have the starting address of the segment in main memory
and the length of the segment.

Procedure is similar to paging, except requires checking against size of segment and
requires addition rather than appending numbers.
\end{document}
